; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p1-5 - location
	p2-5 - location
	p2-8 - location
	p3-7 - location
	p4-0 - location
	p4-8 - location
	p4-9 - location
	p4-10 - location
	p4-12 - location
	p5-4 - location
	p5-7 - location
	p7-6 - location
	p8-0 - location
	p8-3 - location
	p10-6 - location
	p10-8 - location
	p10-9 - location
	p12-1 - location
	p12-7 - location
	p12-9 - location
	p12-11 - location
	)
	(:init
	(at driver1 s10)
	(at driver2 s10)
	(at driver3 s7)
	(at driver4 s4)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s9)
	(empty truck3)
	(at package1 s12)
	(at package2 s8)
	(at package3 s1)
	(at package4 s11)
	(at package5 s6)
	(at package6 s4)
	(at package7 s3)
	(at package8 s0)
	(at package9 s3)
	(at package10 s8)
	(at package11 s8)
	(at package12 s10)
	(at package13 s6)
	(at package14 s5)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 76)
	(= (time-to-walk p1-5 s1) 76)
	(= (time-to-walk s5 p1-5) 66)
	(= (time-to-walk p1-5 s5) 66)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 31)
	(= (time-to-walk p2-5 s2) 31)
	(= (time-to-walk s5 p2-5) 76)
	(= (time-to-walk p2-5 s5) 76)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(= (time-to-walk s2 p2-8) 2)
	(= (time-to-walk p2-8 s2) 2)
	(= (time-to-walk s8 p2-8) 19)
	(= (time-to-walk p2-8 s8) 19)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 83)
	(= (time-to-walk p3-7 s3) 83)
	(= (time-to-walk s7 p3-7) 28)
	(= (time-to-walk p3-7 s7) 28)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 43)
	(= (time-to-walk p4-0 s4) 43)
	(= (time-to-walk s0 p4-0) 2)
	(= (time-to-walk p4-0 s0) 2)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 29)
	(= (time-to-walk p4-8 s4) 29)
	(= (time-to-walk s8 p4-8) 98)
	(= (time-to-walk p4-8 s8) 98)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(= (time-to-walk s4 p4-9) 1)
	(= (time-to-walk p4-9 s4) 1)
	(= (time-to-walk s9 p4-9) 57)
	(= (time-to-walk p4-9 s9) 57)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(= (time-to-walk s4 p4-10) 79)
	(= (time-to-walk p4-10 s4) 79)
	(= (time-to-walk s10 p4-10) 17)
	(= (time-to-walk p4-10 s10) 17)
	(path s4 p4-12)
	(path p4-12 s4)
	(path s12 p4-12)
	(path p4-12 s12)
	(= (time-to-walk s4 p4-12) 23)
	(= (time-to-walk p4-12 s4) 23)
	(= (time-to-walk s12 p4-12) 30)
	(= (time-to-walk p4-12 s12) 30)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 50)
	(= (time-to-walk p5-4 s5) 50)
	(= (time-to-walk s4 p5-4) 86)
	(= (time-to-walk p5-4 s4) 86)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 74)
	(= (time-to-walk p5-7 s5) 74)
	(= (time-to-walk s7 p5-7) 24)
	(= (time-to-walk p5-7 s7) 24)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(= (time-to-walk s7 p7-6) 67)
	(= (time-to-walk p7-6 s7) 67)
	(= (time-to-walk s6 p7-6) 88)
	(= (time-to-walk p7-6 s6) 88)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(= (time-to-walk s8 p8-0) 21)
	(= (time-to-walk p8-0 s8) 21)
	(= (time-to-walk s0 p8-0) 20)
	(= (time-to-walk p8-0 s0) 20)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(= (time-to-walk s8 p8-3) 15)
	(= (time-to-walk p8-3 s8) 15)
	(= (time-to-walk s3 p8-3) 78)
	(= (time-to-walk p8-3 s3) 78)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(= (time-to-walk s10 p10-6) 64)
	(= (time-to-walk p10-6 s10) 64)
	(= (time-to-walk s6 p10-6) 34)
	(= (time-to-walk p10-6 s6) 34)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(= (time-to-walk s10 p10-8) 80)
	(= (time-to-walk p10-8 s10) 80)
	(= (time-to-walk s8 p10-8) 40)
	(= (time-to-walk p10-8 s8) 40)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(= (time-to-walk s10 p10-9) 100)
	(= (time-to-walk p10-9 s10) 100)
	(= (time-to-walk s9 p10-9) 11)
	(= (time-to-walk p10-9 s9) 11)
	(path s12 p12-1)
	(path p12-1 s12)
	(path s1 p12-1)
	(path p12-1 s1)
	(= (time-to-walk s12 p12-1) 16)
	(= (time-to-walk p12-1 s12) 16)
	(= (time-to-walk s1 p12-1) 1)
	(= (time-to-walk p12-1 s1) 1)
	(path s12 p12-7)
	(path p12-7 s12)
	(path s7 p12-7)
	(path p12-7 s7)
	(= (time-to-walk s12 p12-7) 29)
	(= (time-to-walk p12-7 s12) 29)
	(= (time-to-walk s7 p12-7) 99)
	(= (time-to-walk p12-7 s7) 99)
	(path s12 p12-9)
	(path p12-9 s12)
	(path s9 p12-9)
	(path p12-9 s9)
	(= (time-to-walk s12 p12-9) 29)
	(= (time-to-walk p12-9 s12) 29)
	(= (time-to-walk s9 p12-9) 72)
	(= (time-to-walk p12-9 s9) 72)
	(path s12 p12-11)
	(path p12-11 s12)
	(path s11 p12-11)
	(path p12-11 s11)
	(= (time-to-walk s12 p12-11) 100)
	(= (time-to-walk p12-11 s12) 100)
	(= (time-to-walk s11 p12-11) 57)
	(= (time-to-walk p12-11 s11) 57)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 69)
	(= (time-to-drive s1 s0) 69)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 100)
	(= (time-to-drive s3 s0) 100)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 14)
	(= (time-to-drive s11 s0) 14)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 48)
	(= (time-to-drive s2 s1) 48)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 17)
	(= (time-to-drive s7 s1) 17)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 37)
	(= (time-to-drive s9 s1) 37)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 78)
	(= (time-to-drive s12 s1) 78)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 66)
	(= (time-to-drive s0 s2) 66)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 22)
	(= (time-to-drive s10 s2) 22)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 51)
	(= (time-to-drive s8 s3) 51)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 90)
	(= (time-to-drive s5 s4) 90)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 89)
	(= (time-to-drive s7 s4) 89)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 38)
	(= (time-to-drive s8 s4) 38)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 10)
	(= (time-to-drive s11 s4) 10)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 8)
	(= (time-to-drive s10 s5) 8)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 53)
	(= (time-to-drive s4 s6) 53)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 87)
	(= (time-to-drive s8 s6) 87)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 72)
	(= (time-to-drive s10 s6) 72)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 86)
	(= (time-to-drive s11 s7) 86)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 67)
	(= (time-to-drive s0 s8) 67)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 12)
	(= (time-to-drive s7 s8) 12)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 86)
	(= (time-to-drive s10 s8) 86)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 77)
	(= (time-to-drive s0 s9) 77)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 27)
	(= (time-to-drive s2 s9) 27)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 87)
	(= (time-to-drive s6 s9) 87)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 6)
	(= (time-to-drive s7 s9) 6)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 26)
	(= (time-to-drive s0 s10) 26)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 15)
	(= (time-to-drive s12 s10) 15)
	(link s11 s5)
	(link s5 s11)
	(= (time-to-drive s11 s5) 77)
	(= (time-to-drive s5 s11) 77)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 25)
	(= (time-to-drive s8 s11) 25)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 71)
	(= (time-to-drive s4 s12) 71)
	(link s12 s6)
	(link s6 s12)
	(= (time-to-drive s12 s6) 46)
	(= (time-to-drive s6 s12) 46)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 25)
	(= (time-to-drive s9 s12) 25)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 85)
	(= (time-to-drive s11 s12) 85)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver2 s8)
	(at driver3 s0)
	(at driver4 s1)
	(at truck2 s2)
	(at truck3 s2)
	(at package1 s5)
	(at package2 s2)
	(at package3 s7)
	(at package4 s5)
	(at package6 s11)
	(at package7 s3)
	(at package8 s7)
	(at package9 s10)
	(at package10 s6)
	(at package11 s5)
	(at package12 s1)
	(at package13 s3)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver1 s10 p10-9)
   deleted: (at driver1 s10)
   added: (at driver1 p10-9)
   changed: (walked) from 0 to 100
   goals met: 1 of 18
2. (walk driver1 p10-9 s9)
   deleted: (at driver1 p10-9)
   added: (at driver1 s9)
   changed: (walked) from 100 to 111
   goals met: 1 of 18
3. (board-truck driver1 truck3 s9)
   deleted: (at driver1 s9) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 1 of 18
4. (drive-truck truck3 s9 s7 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   changed: (driven) from 0 to 6
   goals met: 1 of 18
5. (drive-truck truck3 s7 s4 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   changed: (driven) from 6 to 95
   goals met: 1 of 18
6. (load-truck package6 truck3 s4)
   deleted: (at package6 s4)
   added: (in package6 truck3)
   goals met: 1 of 18
7. (walk driver3 s7 p3-7)
   deleted: (at driver3 s7)
   added: (at driver3 p3-7)
   changed: (walked) from 111 to 139
   goals met: 1 of 18
8. (walk driver2 s10 p10-8)
   deleted: (at driver2 s10)
   added: (at driver2 p10-8)
   changed: (walked) from 139 to 219
   goals met: 1 of 18
9. (walk driver2 p10-8 s8)
   deleted: (at driver2 p10-8)
   added: (at driver2 s8)
   changed: (walked) from 219 to 259
   goals met: 2 of 18
10. (drive-truck truck3 s4 s12 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s12)
   changed: (driven) from 95 to 166
   goals met: 2 of 18
11. (drive-truck truck3 s12 s10 driver1)
   deleted: (at truck3 s12)
   added: (at truck3 s10)
   changed: (driven) from 166 to 181
   goals met: 2 of 18
12. (walk driver3 p3-7 s3)
   deleted: (at driver3 p3-7)
   added: (at driver3 s3)
   changed: (walked) from 259 to 342
   goals met: 2 of 18
13. (load-truck package12 truck3 s10)
   deleted: (at package12 s10)
   added: (in package12 truck3)
   goals met: 2 of 18
14. (walk driver4 s4 p5-4)
   deleted: (at driver4 s4)
   added: (at driver4 p5-4)
   changed: (walked) from 342 to 428
   goals met: 2 of 18
15. (walk driver4 p5-4 s5)
   deleted: (at driver4 p5-4)
   added: (at driver4 s5)
   changed: (walked) from 428 to 478
   goals met: 2 of 18
16. (drive-truck truck3 s10 s0 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s0)
   changed: (driven) from 181 to 207
   goals met: 2 of 18
17. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   changed: (walked) from 478 to 544
   goals met: 2 of 18
18. (drive-truck truck3 s0 s8 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s8)
   changed: (driven) from 207 to 274
   goals met: 2 of 18
19. (load-truck package2 truck3 s8)
   deleted: (at package2 s8)
   added: (in package2 truck3)
   goals met: 2 of 18
20. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   changed: (walked) from 544 to 620
   goals met: 3 of 18
21. (load-truck package10 truck3 s8)
   deleted: (at package10 s8)
   added: (in package10 truck3)
   goals met: 3 of 18
22. (load-truck package11 truck3 s8)
   deleted: (at package11 s8)
   added: (in package11 truck3)
   goals met: 3 of 18
23. (drive-truck truck3 s8 s0 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s0)
   changed: (driven) from 274 to 341
   goals met: 3 of 18
24. (load-truck package8 truck3 s0)
   deleted: (at package8 s0)
   added: (in package8 truck3)
   goals met: 3 of 18
25. (drive-truck truck3 s0 s11 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s11)
   changed: (driven) from 341 to 355
   goals met: 3 of 18
26. (unload-truck package6 truck3 s11)
   deleted: (in package6 truck3)
   added: (at package6 s11)
   goals met: 4 of 18
27. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 4 of 18
28. (drive-truck truck3 s11 s12 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s12)
   changed: (driven) from 355 to 440
   goals met: 4 of 18
29. (load-truck package9 truck2 s3)
   deleted: (at package9 s3)
   added: (in package9 truck2)
   goals met: 4 of 18
30. (drive-truck truck3 s12 s6 driver1)
   deleted: (at truck3 s12)
   added: (at truck3 s6)
   changed: (driven) from 440 to 486
   goals met: 4 of 18
31. (unload-truck package10 truck3 s6)
   deleted: (in package10 truck3)
   added: (at package10 s6)
   goals met: 5 of 18
32. (load-truck package13 truck3 s6)
   deleted: (at package13 s6)
   added: (in package13 truck3)
   goals met: 5 of 18
33. (drive-truck truck3 s6 s12 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s12)
   changed: (driven) from 486 to 532
   goals met: 5 of 18
34. (load-truck package1 truck3 s12)
   deleted: (at package1 s12)
   added: (in package1 truck3)
   goals met: 5 of 18
35. (drive-truck truck3 s12 s11 driver1)
   deleted: (at truck3 s12)
   added: (at truck3 s11)
   changed: (driven) from 532 to 617
   goals met: 5 of 18
36. (load-truck package4 truck3 s11)
   deleted: (at package4 s11)
   added: (in package4 truck3)
   goals met: 5 of 18
37. (drive-truck truck3 s11 s7 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s7)
   changed: (driven) from 617 to 703
   goals met: 5 of 18
38. (unload-truck package8 truck3 s7)
   deleted: (in package8 truck3)
   added: (at package8 s7)
   goals met: 6 of 18
39. (drive-truck truck2 s3 s0 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 703 to 803
   goals met: 6 of 18
40. (drive-truck truck2 s0 s10 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s10)
   changed: (driven) from 803 to 829
   goals met: 6 of 18
41. (unload-truck package9 truck2 s10)
   deleted: (in package9 truck2)
   added: (at package9 s10)
   goals met: 7 of 18
42. (drive-truck truck2 s10 s0 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s0)
   changed: (driven) from 829 to 855
   goals met: 7 of 18
43. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 8 of 18
44. (drive-truck truck3 s7 s8 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s8)
   changed: (driven) from 855 to 867
   goals met: 8 of 18
45. (drive-truck truck3 s8 s0 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s0)
   changed: (driven) from 867 to 934
   goals met: 8 of 18
46. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 934 to 1000
   goals met: 9 of 18
47. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 10 of 18
48. (drive-truck truck3 s2 s10 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s10)
   changed: (driven) from 1000 to 1022
   goals met: 9 of 18
49. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 18
50. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 1022 to 1091
   goals met: 8 of 18
51. (load-truck package3 truck2 s1)
   deleted: (at package3 s1)
   added: (in package3 truck2)
   goals met: 8 of 18
52. (drive-truck truck2 s1 s7 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (driven) from 1091 to 1108
   goals met: 8 of 18
53. (unload-truck package3 truck2 s7)
   deleted: (in package3 truck2)
   added: (at package3 s7)
   goals met: 9 of 18
54. (drive-truck truck2 s7 s9 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s9)
   changed: (driven) from 1108 to 1114
   goals met: 9 of 18
55. (drive-truck truck2 s9 s0 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s0)
   changed: (driven) from 1114 to 1191
   goals met: 9 of 18
56. (drive-truck truck3 s10 s5 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s5)
   changed: (driven) from 1191 to 1199
   goals met: 9 of 18
57. (unload-truck package4 truck3 s5)
   deleted: (in package4 truck3)
   added: (at package4 s5)
   goals met: 10 of 18
58. (unload-truck package11 truck3 s5)
   deleted: (in package11 truck3)
   added: (at package11 s5)
   goals met: 11 of 18
59. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 1199 to 1265
   goals met: 12 of 18
60. (drive-truck truck3 s5 s11 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s11)
   changed: (driven) from 1265 to 1342
   goals met: 12 of 18
61. (drive-truck truck3 s11 s0 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s0)
   changed: (driven) from 1342 to 1356
   goals met: 12 of 18
62. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 1356 to 1422
   goals met: 13 of 18
63. (unload-truck package13 truck3 s2)
   deleted: (in package13 truck3)
   added: (at package13 s2)
   goals met: 13 of 18
64. (drive-truck truck3 s2 s10 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s10)
   changed: (driven) from 1422 to 1444
   goals met: 12 of 18
65. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 1444 to 1510
   goals met: 11 of 18
66. (drive-truck truck3 s10 s5 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s5)
   changed: (driven) from 1510 to 1518
   goals met: 11 of 18
67. (unload-truck package1 truck3 s5)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   goals met: 12 of 18
68. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 1518 to 1584
   goals met: 13 of 18
69. (load-truck package13 truck2 s2)
   deleted: (at package13 s2)
   added: (in package13 truck2)
   goals met: 13 of 18
70. (drive-truck truck3 s5 s10 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s10)
   changed: (driven) from 1584 to 1592
   goals met: 13 of 18
71. (drive-truck truck3 s10 s2 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s2)
   changed: (driven) from 1592 to 1614
   goals met: 14 of 18
72. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 1614 to 1680
   goals met: 13 of 18
73. (drive-truck truck2 s0 s3 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (driven) from 1680 to 1780
   goals met: 13 of 18
74. (unload-truck package13 truck2 s3)
   deleted: (in package13 truck2)
   added: (at package13 s3)
   goals met: 14 of 18
75. (drive-truck truck2 s3 s0 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 1780 to 1880
   goals met: 14 of 18
76. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 1880 to 1946
   goals met: 15 of 18
77. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 15 of 18
78. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 1946 to 1994
   goals met: 14 of 18
79. (unload-truck package12 truck3 s1)
   deleted: (in package12 truck3)
   added: (at package12 s1)
   goals met: 15 of 18
80. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 1994 to 2042
   goals met: 16 of 18
81. (drive-truck truck3 s2 s10 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s10)
   changed: (driven) from 2042 to 2064
   goals met: 15 of 18
82. (disembark-truck driver1 truck3 s10)
   deleted: (driving driver1 truck3)
   added: (at driver1 s10) (empty truck3)
   goals met: 15 of 18
83. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 15 of 18
84. (drive-truck truck2 s2 s10 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s10)
   changed: (driven) from 2064 to 2086
   goals met: 14 of 18
85. (drive-truck truck2 s10 s5 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s5)
   changed: (driven) from 2086 to 2094
   goals met: 14 of 18
86. (board-truck driver1 truck3 s10)
   deleted: (at driver1 s10) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 14 of 18
87. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 14 of 18
88. (drive-truck truck3 s10 s2 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s2)
   changed: (driven) from 2094 to 2116
   goals met: 15 of 18
89. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 15 of 18
90. (walk driver3 s5 p5-4)
   deleted: (at driver3 s5)
   added: (at driver3 p5-4)
   changed: (walked) from 620 to 670
   goals met: 15 of 18
91. (walk driver3 p5-4 s4)
   deleted: (at driver3 p5-4)
   added: (at driver3 s4)
   changed: (walked) from 670 to 756
   goals met: 15 of 18
92. (walk driver1 s2 p2-5)
   deleted: (at driver1 s2)
   added: (at driver1 p2-5)
   changed: (walked) from 756 to 787
   goals met: 15 of 18
93. (walk driver1 p2-5 s5)
   deleted: (at driver1 p2-5)
   added: (at driver1 s5)
   changed: (walked) from 787 to 863
   goals met: 16 of 18
94. (walk driver3 s4 p4-0)
   deleted: (at driver3 s4)
   added: (at driver3 p4-0)
   changed: (walked) from 863 to 906
   goals met: 16 of 18
95. (walk driver3 p4-0 s0)
   deleted: (at driver3 p4-0)
   added: (at driver3 s0)
   changed: (walked) from 906 to 908
   goals met: 17 of 18
96. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 16 of 18
97. (drive-truck truck2 s5 s10 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s10)
   changed: (driven) from 2116 to 2124
   goals met: 16 of 18
98. (drive-truck truck2 s10 s2 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s2)
   changed: (driven) from 2124 to 2146
   goals met: 17 of 18
99. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 17 of 18
100. (walk driver1 s2 p2-5)
   deleted: (at driver1 s2)
   added: (at driver1 p2-5)
   changed: (walked) from 908 to 939
   goals met: 17 of 18
101. (walk driver1 p2-5 s5)
   deleted: (at driver1 p2-5)
   added: (at driver1 s5)
   changed: (walked) from 939 to 1015
   goals met: 18 of 18
